package Color_yr.ColorMirai.Pack;

/*
类型说明
0 插件开始连接
1 [机器人]图片上传前. 可以阻止上传（事件）
2 [机器人]头像被修改（通过其他客户端修改了头像）（事件）
3 [机器人]在群里的权限被改变. 操作人一定是群主（事件）
4 [机器人]被邀请加入一个群（事件）
5 [机器人]成功加入了一个新群（不确定. 可能是主动加入）（事件）
6 [机器人]成功加入了一个新群（机器人被一个群内的成员直接邀请加入了群）（事件）
7 [机器人]主动退出一个群（事件）
8 [机器人]被管理员或群主踢出群（事件）
9 [机器人]被禁言（事件）
10 [机器人]主动离线（事件）
11 [机器人]被挤下线（事件）
12 [机器人]被服务器断开（事件）
13 [机器人]因网络问题而掉线（事件）
14 [机器人]服务器主动要求更换另一个服务器（事件）
15 [机器人]登录完成, 好友列表, 群组列表初始化完成（事件）
16 [机器人]主动或被动重新登录（事件）
17 [机器人]被取消禁言（事件）
18 [机器人]成功添加了一个新好友（事件）
*/
public class PackBuilder {

}
